In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [3]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [6]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [7]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [8]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
series = df1.iloc[0]
series

a    0.0
b    1.0
c    2.0
d    3.0
Name: 0, dtype: float64

In [15]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [16]:
df1 - series

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  4.0  4.0  4.0  4.0
2  8.0  8.0  8.0  8.0

In [17]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.236260  0.300012  1.577719
Ohio    1.125207  0.133948  1.595256
Texas   0.493924 -0.957119 -0.555954
Oregon  0.834940 -1.108350 -0.149476

In [18]:
# Valor absoluto del frame
np.abs(frame)

               b         d         e
Utah    1.236260  0.300012  1.577719
Ohio    1.125207  0.133948  1.595256
Texas   0.493924  0.957119  0.555954
Oregon  0.834940  1.108350  0.149476

In [19]:
# Aplicar una funcion al dataframe
f = lambda x: x.max() - x.min()
# aplicado a la columna por defecto
frame.apply(f)

b    2.361467
d    1.408362
e    2.151210
dtype: float64

In [20]:
# aplicado a filas
frame.apply(f, axis=1)

Utah      2.813979
Ohio      1.461308
Texas     1.451042
Oregon    1.943290
dtype: float64

In [21]:
## applymap. Each item of df
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -1.24   0.30   1.58
Ohio     1.13   0.13   1.60
Texas    0.49  -0.96  -0.56
Oregon   0.83  -1.11  -0.15

In [23]:
# indicando una columna a la cual aplicar el applymap
frame['e'].map(format)

Utah       1.58
Ohio       1.60
Texas     -0.56
Oregon    -0.15
Name: e, dtype: object

# Sorting and ranking

In [24]:
obj = Series(range(4), index=['d', 'a', 'c', 'b'])
obj

d    0
a    1
c    2
b    3
dtype: int64

In [25]:
# Sort index
obj.sort_index()

a    1
b    3
c    2
d    0
dtype: int64

In [26]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [27]:
## Dataframe sort
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [30]:
## Sort by columns
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [31]:
## The data is sorted in ascending by default
## especific descending
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [32]:
## sort values
obj = Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [34]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [35]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [38]:
frame.sort_values(by='b', ascending=False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [41]:
frame.sort_values(by=['a','b']).sort_index(axis=1)

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [2]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [3]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64